import React from 'react';
import { Card, CardImg, CardText, CardBody, CardTitle, CardSubtitle, Button }
from 'reactstrap';
import './cssComponent.css';


const TriangleCard = (props) => {
  return (
    <div>
    <Card body inverse color="info" className="csscard2">
      <CardTitle><h4 className="cssh">
      مُثَلَّث یا سه‌گوش (در فارسی تاجیکی: سه‌کُنجَه) یک چندضلعی با سه ضلع است. مثلث شکلی مسطح است که از اتصال سه نقطه غیرهم‌خط در صفحه به وجود می‌آید. مثلث دارای سه ضلع، سه زاویه، و سه رأس است.
       </h4></CardTitle>
      <CardText><h5 className="cssh">
      <p>در مثلث مجموع هر دو ضلع، بزرگتر از ضلع سوم است.</p>
      <p>در مثلث هر ضلع، بزرگتر از تفاضل بین دو ضلع دیگر است.</p>
      <p>مجموع زاویه‌های داخلی مثلث ۱۸۰ درجه است. مجموع زاویه‌های خارجی مثلث ۳۶۰ درجه است. هر زاویه خارجی برابر مجموع دو زاویه داخلی غیر مجاور آن است. مجموعه زوایای خارجی هر مثلث، دو برابر مجموع زوایای داخلی آن است.
در هندسه اقلیدسی مجموع اندازه زوایای هر مثلث برابر ۱۸۰ درجه‌است.</p>
      <p>مثلث متساوی‌الاضلاع یا سه‌پهلوبرابر در هندسه به مثلثی گفته می‌شود که سه ضلع آن برابر باشند.</p>
      <p>مثلث متساوی‌الساقین مثلثی است که حتماً دو ساق آن با هم برابر باشند. این مثلث، علاوه بر داشتن دو ضلع برابر، دو زاویهٔ برابر هم دارد و آن دو زاویه، گوشه‌هایی هستند که روبه‌روی اضلاع برابر قرار گرفته‌اند. </p>
      </h5></CardText>
    </Card>
    </div>
  );
};

export default TriangleCard;
